Дипломная_работа/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <attributes>
    <name>BKM_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BKM_ОтпускаСотрудников</name>
    <attributes>
      <name>BKM_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ДнейВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
// Файл: Конфигурация/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	BKM_ПересчитатьИПодсветить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура BKM_ПересчитатьИПодсветить()

	Для каждого Стр Из Объект.BKM_ОтпускаСотрудников Цикл

		Если Стр.BKM_ДатаНачала = Неопределено Или Стр.BKM_ДатаОкончания = Неопределено Тогда
			Стр.BKM_Дней = 0;
			Продолжить;
		КонецЕсли;

		// Нормализуем до начала дня, чтобы не влияли часы/минуты
		ДатаНач = НачалоДня(Стр.BKM_ДатаНачала);
		ДатаКон = НачалоДня(Стр.BKM_ДатаОкончания);

		// Разница дат в 1С — это число секунд
		РазницаСек = ДатаКон - ДатаНач;

		// Переводим в дни и делаем включительно (+1)
		Дней = Цел(РазницаСек / 86400) + 1;

		Если Дней < 0 Тогда
			Дней = 0;
		КонецЕсли;

		Стр.BKM_Дней = Дней;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
